notes/app/controllers/notes_controller.rb

    def create
         @note = Note.new(note_params)
         @note.user = current_user

        if @note.save
---
INSERT INTO "notes" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "NoteTest1"], ["text", "Test 1"], ["created_at", "2019-10-28 22:35:52.316942"], ["updated_at", "2019-10-28 22:35:52.316942"]]